In [44]:
import numpy as np

In [45]:
import pandas as pd

In [46]:
labels = ['a','b','c']
my_data = [10,20,30]
arr = np.array(my_data)
d = {'a':10,'b':20,'c':30}

In [47]:
pd.Series(my_data)

0    10
1    20
2    30
dtype: int64

In [48]:
pd.Series(data = my_data, index = labels)

a    10
b    20
c    30
dtype: int64

In [49]:
pd.Series(my_data,labels)

a    10
b    20
c    30
dtype: int64

In [50]:
pd.Series(arr)

0    10
1    20
2    30
dtype: int64

In [51]:
pd.Series(arr,labels)

a    10
b    20
c    30
dtype: int64

In [52]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [53]:
pd.Series(labels)

0    a
1    b
2    c
dtype: object

In [54]:
pd.Series([sum,print,len])

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

In [55]:
ser1 = pd.Series([1,2,3,4],['USA','Germany','USSR','Japan'])

In [56]:
ser1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [57]:
ser2 = pd.Series([1,2,5,4],['USA','Germany','Italy','Japan'])

In [58]:
ser2

USA        1
Germany    2
Italy      5
Japan      4
dtype: int64

In [59]:
ser1['USA']

1

In [60]:
ser3 = pd.Series(data = labels)

In [61]:
ser3

0    a
1    b
2    c
dtype: object

In [62]:
ser3[0]

'a'

In [63]:
ser1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [64]:
ser2

USA        1
Germany    2
Italy      5
Japan      4
dtype: int64

In [65]:
ser1 + ser2

Germany    4.0
Italy      NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64

In [66]:
from numpy.random import randn

In [67]:
np.random.seed(101)

In [68]:
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [69]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [70]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [71]:
type(df['W'])

pandas.core.series.Series

In [72]:
type(df)

pandas.core.frame.DataFrame

In [73]:
df.W

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [74]:
df[['W','Z']]

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [75]:
df['new'] = df['W'] + df['Y']

In [76]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [77]:
df.drop('new',axis = 1,inplace=True)

In [78]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [79]:
df.drop('E')

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [80]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [81]:
df.drop('E',inplace = True)

In [82]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [83]:
df.shape

(4, 4)

In [84]:
df.loc['A']

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [86]:
df.loc[['A','B']]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965

In [87]:
df.iloc[1,2]

-0.8480769834036315

In [88]:
df.iloc[2]

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

In [89]:
df.loc['B','Y']

-0.8480769834036315

In [90]:
df.loc[['A','B'],['W','Y']]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077